tap "mas-cli/tap"

#cask "microsoft-office-businesspro"
cask "slack"
cask "appcleaner"
cask "google-cloud-sdk"

brew "nvm"
brew "mas-cli/tap/mas"
brew "imagemagick"
brew "bat"
brew "exa"
brew "git-extras"
brew "pinentry-mac"
brew "bcal"
brew "git-lfs"
brew "helm"
brew "gitmux"
brew "httpie"
brew "powershell"
brew "vault"
brew "fd"
brew "pre-commit"
brew "fizz"
brew "gnu-sed"
brew "stern"
brew "ca-certificates"
brew "fontconfig"
brew "gnupg"
brew "stow"
brew "jq"
brew "yq"
brew "xz"
brew "tfenv"
brew "tflint"
brew "dog"
brew "thefuck"
brew "tmux"
brew "gh"
brew "lazygit"
brew "tmuxinator"
brew "grep"
brew "mcfly"
brew "tree-sitter"
brew "pinentry"
brew "git-delta"
brew "s-search"
brew "minikube"

cask "1password-cli"
cask "amethyst"
cask "font-hack-nerd-font"
cask "ngrok"
cask "alacritty"
cask "font-fira-code-nerd-font"

cask "google-chrome"
cask "firefox"
cask "opera"

vscode "1password.op-vscode"
vscode "42crunch.vscode-openapi"
vscode "aaron-bond.better-comments"
vscode "ahmadawais.shades-of-purple"
vscode "albert.tabout"
vscode "alefragnani.bookmarks"
vscode "alefragnani.project-manager"
vscode "arjun.swagger-viewer"
vscode "astro-build.astro-vscode"
vscode "benshabatnoam.google-translate-ext"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "btamburrino.apex-javadoc"
vscode "compilenix.vscode-zonefile"
vscode "coolbear.systemd-unit-file"
vscode "cschlosser.doxdocgen"
vscode "dbaeumer.vscode-eslint"
vscode "deadrevolver.dark-space-theme"
vscode "denoland.vscode-deno"
vscode "digitalbrainstem.javascript-ejs-support"
vscode "dracula-theme.theme-dracula"
vscode "editorconfig.editorconfig"
vscode "eliverlara.andromeda"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "fabiospampinato.vscode-todo-plus"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.copilot-labs"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "hashicorp.terraform"
vscode "humao.rest-client"
vscode "intility.vscode-backstage"
vscode "jakebecker.elixir-ls"
vscode "janjoerke.jenkins-pipeline-linter-connector"
vscode "johnpapa.vscode-peacock"
vscode "kangping.protobuf"
vscode "keesschollaart.vscode-home-assistant"
vscode "kumar-harsh.graphql-for-vscode"
vscode "leetcode.vscode-leetcode"
vscode "madhavd1.javadoc-tools"
vscode "marqu3s.aurora-x"
vscode "mechatroner.rainbow-csv"
vscode "mellowmarshmallow.groovy"
vscode "mhutchie.git-graph"
vscode "mikestead.dotenv"
vscode "monokai.theme-monokai-pro-vscode"
vscode "mrmlnc.vscode-apache"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-ossdata.vscode-postgresql"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.powershell"
vscode "ms-vscode.sublime-keybindings"
vscode "ms-vscode.vscode-speech"
vscode "ms-vsliveshare.vsliveshare"
vscode "ms-vsliveshare.vsliveshare-pack"
vscode "nicolasvuillamy.vscode-groovy-lint"
vscode "pflannery.vscode-versionlens"
vscode "pnp.polacode"
vscode "pomber.git-file-history"
vscode "pranaygp.vscode-css-peek"
vscode "prisma.prisma"
vscode "puppet.puppet-vscode"
vscode "rebornix.ruby"
vscode "redhat.java"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "sdras.night-owl"
vscode "shalldie.background"
vscode "stringham.move-ts"
vscode "svelte.svelte-vscode"
vscode "tamasfe.even-better-toml"
vscode "teabyii.ayu"
vscode "twxs.cmake"
vscode "tyriar.sort-lines"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "vscode-icons-team.vscode-icons"
vscode "waderyan.gitblame"
vscode "wesbos.theme-cobalt2"
vscode "william-voyek.vscode-nginx"
vscode "wingrunr21.vscode-ruby"
vscode "wix.vscode-import-cost"
vscode "wmaurer.change-case"
vscode "xaver.clang-format"
vscode "yoavbls.pretty-ts-errors"
