tap "mas-cli/tap"
tap "tofuutils/tap"
tap "hashicorp/tap"

###################################################################################################################
##### DESKTOP TOOLING #############################################################################################
###################################################################################################################

# https://microsoft.com
# Microsoft Office is a suite of office software developed by Microsoft.
cask "microsoft-office-businesspro"

# https://slack.com/
# Slack is a collaboration hub for work, no matter what work you do.
cask "slack"

# https://freemacsoft.net/appcleaner/
# AppCleaner is a small application which allows you to thoroughly uninstall unwanted apps.
cask "appcleaner"

# https://www.alfredapp.com/
# Alfred is a replacement for Spotlight, with a lot of extra features.
cask "alfred"

# https://alt-tab-macos.netlify.app/
# AltTab brings the power of Windows’s “alt-tab” window switcher to macOS.
cask "alt-tab"

# https://github.com/ianyh/Amethyst
# Tiling window manager for macOS along the lines of xmonad.
cask "amethyst"

# https://www.7-zip.org/
# 7-Zip (high compression file archiver) implementation.
brew "p7zip"

# https://tunnelblick.net/
# Tunnelblick is a free, open source graphic user interface for OpenVPN on macOS.
cask "tunnelblick"

# ghostty terminal emulator.
cask "ghostty"

###################################################################################################################
##### UTILITIES ###################################################################################################
###################################################################################################################

brew "libadwaita"                  # Adwaita GTK library for macOS.
brew "yazi"                        # A terminal file manager written in rust.
brew "podman"                      # Podman as a Docker alternative.
brew "xk6"                         # A tool for building custom k6 binaries.
brew "k6"                          # Modern load testing tool, using Go and JavaScript.
brew "act"                         # Run GitHub Actions locally.
brew "b2-tools"                    # Backblaze B2 command-line tool.
brew "goenv"                       # Go Version Manager.
brew "pipx"                        # Install and run Python applications in isolated environments.
brew "libgit2@1.7"                 # C implementation of the Git core methods as a library.
brew "terraform-ls"                # Terraform Language Server.
brew "tlrc"                        # MAN replacement.
brew "kubectx"                     # Kubernetes context switcher.
brew "kustomize"                   # Kubernetes configuration management.
brew "bottom"                      # A customizable cross-platform graphical process/system monitor for the terminal.
brew "neovim"                      # Vim-fork focused on extensibility and usability.
cask "google-cloud-sdk"            # Google Cloud SDK.
brew "imagemagick"                 # ImageMagick.
brew "bat"                         # A cat(1) clone with wings.
brew "eza"                         # A modern replacement for 'ls'.
brew "git-extras"                  # GIT utilities -- repo summary, repl, changelog population.
brew "bcal"                        # A command-line calculator.
brew "git-lfs"                     # Git extension for versioning large files.
brew "pinentry-mac"                # Pinentry for GPG.
brew "helm"                        # The Kubernetes Package Manager.
brew "gitmux"                      # A command line tool to execute a command on multiple git repositories.
brew "httpie"                      # A user-friendly cURL replacement.
brew "powershell"                  # PowerShell for every system!
brew "vault"                       # A tool for managing secrets.
brew "fd"                          # A simple, fast and user-friendly alternative to 'find'.
brew "pre-commit"                  # A framework for managing and maintaining multi-language pre-commit hooks.
brew "fizz"                        # A modern parser generator for C++.
brew "gnu-sed"                     # GNU implementation of the famous stream editor.
brew "stern"                       # Multi pod and container log tailing for Kubernetes.
brew "ca-certificates"             # CA certificates.
brew "fontconfig"                  # Font configuration and customization library.
brew "gnupg"                       # GNU Pretty Good Privacy (PGP) package.
brew "stow"                        # GNU Stow - manage the installation of software packages.
brew "jq"                          # Lightweight and flexible command-line JSON processor.
brew "yq"                          # yq is a lightweight and portable command-line YAML processor.
brew "xz"                          # General-purpose data compression with high compression ratio.
brew "tfenv"                       # Terraform version manager.
brew "tofuenv"                     # OpenTofu version manager.
brew "tflint"                      # Terraform linter.
brew "dog"                         # Command-line DNS client.
brew "thefuck"                     # Programmatically correct mistyped console commands.
brew "tmux"                        # Terminal multiplexer.
brew "gh"                          # GitHub CLI.
brew "lazygit"                     # Simple terminal UI for git commands.
brew "tmuxinator"                  # Manage complex tmux sessions easily.
brew "grep"                        # GNU grep, egrep and fgrep.
brew "mcfly"                       # Fly through your shell history.
brew "tree-sitter"                 # Parser generator tool and incremental parsing library.
brew "pinentry"                    # Passphrase entry dialog utilizing the Assuan protocol.
brew "git-delta"                   # Syntax-highlighting pager for git and diff output.
brew "s-search"                    # Web search from the terminal.
brew "minikube"                    # Run a Kubernetes cluster locally.
brew "mas-cli/tap/mas"             # A simple command line interface for the Mac App Store. Designed for scripting and automation.
cask "1password-cli"               # 1Password Command Line Interface.
cask "font-hack-nerd-font"         # https://gist.github.com/davidteren/898f2dcccd42d9f8680ec69a3a5d350e
cask "ngrok"                       # https://formulae.brew.sh/cask/ngrok
cask "font-fira-code-nerd-font"    # FiraCode Nerd Font (Fira Code)
brew "docker"                      # Pack, ship and run any application as a lightweight container.
brew "docker-compose"              # Define and run multi-container Docker applications.
brew "zoxide"                      # A faster way to navigate your filesystem.
brew "fzf"                         # Command-line fuzzy finder.

###################################################################################################################
##### PROGRAMMING #################################################################################################
###################################################################################################################

brew "nvm"    # NodeJS Version Manager.
brew "rust"   # Rust programming language.
brew "go"     # Go programming language.
brew "gradle" # Gradle build automation tool.

###################################################################################################################
##### BROWSER #####################################################################################################
###################################################################################################################

cask "google-chrome"
cask "firefox"
cask "opera"

###################################################################################################################
##### TERMINAL  ###################################################################################################
###################################################################################################################

brew "jandedobbeleer/oh-my-posh/oh-my-posh"

###################################################################################################################
##### VS CODE EXTENSIONS ##########################################################################################
###################################################################################################################

vscode "1password.op-vscode"
vscode "42crunch.vscode-openapi"
vscode "aaron-bond.better-comments"
vscode "ahmadawais.shades-of-purple"
vscode "albert.tabout"
vscode "alefragnani.bookmarks"
vscode "alefragnani.project-manager"
vscode "arjun.swagger-viewer"
vscode "astro-build.astro-vscode"
vscode "benshabatnoam.google-translate-ext"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "btamburrino.apex-javadoc"
vscode "compilenix.vscode-zonefile"
vscode "coolbear.systemd-unit-file"
vscode "cschlosser.doxdocgen"
vscode "dbaeumer.vscode-eslint"
vscode "deadrevolver.dark-space-theme"
vscode "denoland.vscode-deno"
vscode "digitalbrainstem.javascript-ejs-support"
vscode "dracula-theme.theme-dracula"
vscode "editorconfig.editorconfig"
vscode "eliverlara.andromeda"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "fabiospampinato.vscode-todo-plus"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.copilot-labs"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "hashicorp.terraform"
vscode "humao.rest-client"
vscode "intility.vscode-backstage"
vscode "jakebecker.elixir-ls"
vscode "janjoerke.jenkins-pipeline-linter-connector"
vscode "johnpapa.vscode-peacock"
vscode "kangping.protobuf"
vscode "keesschollaart.vscode-home-assistant"
vscode "kumar-harsh.graphql-for-vscode"
vscode "leetcode.vscode-leetcode"
vscode "madhavd1.javadoc-tools"
vscode "marqu3s.aurora-x"
vscode "mechatroner.rainbow-csv"
vscode "mellowmarshmallow.groovy"
vscode "mhutchie.git-graph"
vscode "mikestead.dotenv"
vscode "monokai.theme-monokai-pro-vscode"
vscode "mrmlnc.vscode-apache"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-ossdata.vscode-postgresql"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.powershell"
vscode "ms-vscode.sublime-keybindings"
vscode "ms-vscode.vscode-speech"
vscode "ms-vsliveshare.vsliveshare"
vscode "ms-vsliveshare.vsliveshare-pack"
vscode "nicolasvuillamy.vscode-groovy-lint"
vscode "pflannery.vscode-versionlens"
vscode "pnp.polacode"
vscode "pomber.git-file-history"
vscode "pranaygp.vscode-css-peek"
vscode "prisma.prisma"
vscode "puppet.puppet-vscode"
vscode "rebornix.ruby"
vscode "redhat.java"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "sdras.night-owl"
vscode "shalldie.background"
vscode "stringham.move-ts"
vscode "svelte.svelte-vscode"
vscode "tamasfe.even-better-toml"
vscode "teabyii.ayu"
vscode "twxs.cmake"
vscode "tyriar.sort-lines"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "vscode-icons-team.vscode-icons"
vscode "waderyan.gitblame"
vscode "wesbos.theme-cobalt2"
vscode "william-voyek.vscode-nginx"
vscode "wingrunr21.vscode-ruby"
vscode "wix.vscode-import-cost"
vscode "wmaurer.change-case"
vscode "xaver.clang-format"
vscode "yoavbls.pretty-ts-errors"
vscode "vscjava.vscode-java-pack"
vscode "vmware.vscode-boot-dev-pack"
